print ("โปรแกรมคำนวนพื้นที่ต่างๆ")
print ("หากต้องการคำนวนพื้นที่เรขาแบบไหนให้กรอกเรขานั้น")
print ("เช่น สี่เหลี่ยม สามเหลี่ยม วงกลม")

A = input()

if A == "สี่เหลี่ยม" :
    print ("จงกรอกความกว้างและความยาวเรียงลำดับ")
    H = int(input())
    L = int(input())
    A4 = H*L
    print("พื้นทีคือ",A4)
if A == "สามเหลี่ยม" :
    print ("จงกรอกความสูงและความยาวฐานเรียงลำดับ")
    H = int(input())
    L = int(input())
    T3 = H*L*1/2
    print("พื้นทีคือ",T3)
if A == "วงกลม" :
    print ("จงกรอกความรัศมี")
    H = int(input())
    O = int(22/7*H*H)
    print("พื้นทีคือ",O)
else :
    print("เรขานี้ไม่มีในระบบ")

